---
kind: method
id: M:Autodesk.Revit.DB.Structure.AnalyticalNodeData.Dispose
source: html/f4d8fa51-0797-5b6c-7e7b-ea493e46b9dd.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalNodeData.Dispose Method

Releases all resources used by the AnalyticalNodeData

## Syntax (C#)
```csharp
public void Dispose()
```